vitzaoral/esp32-beehive-wifi-2/src/main.cpp
#include <Arduino.h>
#include <InternetConnection.h>
#include <Ticker.h>
#include "esp32-hal-cpu.h"

InternetConnection connection;
MeteoData meteoData;
PowerController powerController;
MagneticLockController magneticLockController;

void sendDataToInternet();
void checkMagneticLockAlarm();

Ticker timerSendDataToInternet(sendDataToInternet, 288000);  // 4.8 min 288000
Ticker timerMagneticLockAlarm(checkMagneticLockAlarm, 4321); // 4 sec

// alarm section
void sendDataToBlynkIfAlarm();
Ticker timerSendDataToBlynkIfAlarm(sendDataToBlynkIfAlarm, 20000); // 20 sec

// https://github.com/stephaneAG/SIM800L/blob/master/README.md

void setup()
{
  Serial.begin(115200);

  // save battery, setup lower CPU frequency (default is 240Mhz)
  setCpuFrequencyMhz(80);
  Serial.println("Get CPU Frequency: " + String(getCpuFrequencyMhz()) + "Mhz");

  connection.initialize();

  timerSendDataToInternet.start();
  timerMagneticLockAlarm.start();
  timerSendDataToBlynkIfAlarm.start();

  meteoData.initializeSensors();

  // set first data for gyroscope and magnetic locks, other in timers..
  magneticLockController.setData();
  Serial.println("Setup done, send first data");
  sendDataToInternet();
  Serial.println("First data sended, start loop");
}

void loop()
{
  timerSendDataToInternet.update();
  timerMagneticLockAlarm.update();
  timerSendDataToBlynkIfAlarm.update();

  connection.blynkRunIfAlarm();
}

void sendDataToInternet()
{
  Serial.println("Start initialize Blynk connection");
  if (connection.initializeConnection())
  {
    Serial.println("Setting sensors data");
    meteoData.setData();
    powerController.setData();
    // gyroscope and magnetic locks data are set in other timer more often, so we have actual data

    Serial.println("Sending data to Blynk");
    connection.sendDataToBlynk(meteoData, powerController, magneticLockController);
    connection.checkNewVersionAndUpdate();
    connection.disconnect();
  }
  else
  {
    Serial.println("No internet/blynk connection");
    connection.disconnect();
  }
}

void checkMagneticLockAlarm()
{
  magneticLockController.setData();
  if (magneticLockController.isOk())
  {
    // update blynk data and turn alarm off
    if (connection.isAlarm)
    {
      connection.setMagneticLockControllerDataToBlynkIfAlarm(magneticLockController);
    }
    connection.isAlarm = false;
  }
  else
  {
    connection.isAlarm = true;
    connection.alarmMagneticController(magneticLockController);
  }
}

void sendDataToBlynkIfAlarm()
{
  connection.setMagneticLockControllerDataToBlynkIfAlarm(magneticLockController);
}
